#include <iostream>
#include <cstdlib>    // Include cstdlib for rand() and srand() functions.
#include <ctime>      // Include ctime for the time() function.
using namespace std;


//int randomNumber(int from, int to) {
//	/*
//		- rand() = تولد ارقام عشوائية كبيرة 
//		- % اشارة لباقي القيمة لحصر النواتج في نطاق محدد. رياضياً، باقي قسمة أي رقم على 10 
//		يجب أن يكون محصوراً بين 0 و 9 حصراً.
//		- to = 10 لكي نصل الى احاد الارقام او اول رقم من جهة اليمين يعني مثال:
//		128393 => سنصل الى رقم ثلاث  كم تدربنا عليه في المشاكل السابقة 
//		- from = 1 وهي بداية العداد
//		- السبب الحقيقي لإضافة + 1: هو أن عملية باقي القسمة % تطرد الرقم الأخير من الحساب.
//		لو كانت to = 10 و from = 1، فإن 10 - 1 = 9. 
//		وباقي القسمة على 9 يعطي أرقاماً من 0 إلى 8 فقط (9 أرقام).
//		نحن نريد 10 أرقام (من 1 إلى 10)،
//		لذلك نضيف 1 ليصبح القاسم 10، فيعطينا أرقاماً من 0 إلى 9
//
//		- from =
//		بما اننا ضمنا ان الارقام التي ستاتي بين 0 الى 9
//		يجب علينا  زيدته برقم واحد حتى لا يولد اصفار في البدية لذلك نضيف from + 
//		يعني سيزيح الارقام رقما واحداّ ليصبح الارقام من 1 الى 10
//		
//	*/
//	int randNum = rand() % (to - from + 1) + from;
//	return  randNum;
//}

//void problem19() {
//	// هذا يعطي بداية الارقام ويجب استدعاه الارقام
//	srand((unsigned)time(NULL));
//
//	cout << randomNumber(1, 10) << endl;
//	cout << randomNumber(1, 10) << endl;
//	cout << randomNumber(1, 10) << endl;
//	
//
//}
 
